source variables.scr
read_verilog -netlist ../netlist/$top_entity.v
read_saif -input ../saif/$top_entity.saif -instance LeNet5_tb/UUT -unit ns -scale 1
create_clock -name MY_CLK CK
report_power > $out_dir/report_power_final$ext.txt
quit
